# Pandas

* ### pandas use cases
    * #### Data Tersformation
    * #### Data Analysis
    * #### Data Cleaning
* ### Pandas Notations:
    * #### series---------creating the data
    * #### DataFrame------for making the data in a particular tabular formate

In [1]:
import pandas as pd
internal1={'s1':30,'s2':34,'s3':20}
internal1=pd.Series(internal1)
print(internal1)

s1    30
s2    34
s3    20
dtype: int64

In [3]:
import pandas as pd
internal1={'s1':30,'s2':34,'s3':20}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':40,'s2':30,'s3':28}
internal2=pd.Series(internal2)
print(internal2)

s1    30
s2    34
s3    20
dtype: int64
s1    40
s2    30
s3    28
dtype: int64

In [6]:
final={'INTERNAL1':internal1,'INTERNAL2':internal2}
final=pd.DataFrame(final)
final

    INTERNAL1  INTERNAL2
s1         30         40
s2         34         30
s3         20         28

# display student marks using Pands

In [55]:
#    student names with regno 

name={'515':'vyshnavi','507':'srijanya','547':'usha_sri','537':'sagari'}
name=pd.Series(name)

#    engilsh marks of the student

english={'515':30,'507':40,'547':50,'537':35}
english=pd.Series(english)

#    maths marks of the student

maths={'515':45,'507':34,'547':45,'537':50}
maths=pd.Series(maths)

#     final result (combining name,english marks and maths marks)

final={'NAME':name,'ENGLISH':english,'MATHS':maths}
final=pd.DataFrame(final)
final

         NAME  ENGLISH  MATHS
515  vyshnavi       30     45
507  srijanya       40     34
547  usha_sri       50     45
537    sagari       35     50

In [58]:
final.columns

Index(['NAME', 'ENGLISH', 'MATHS'], dtype='object')

In [59]:
final.values

array([['vyshnavi', 30, 45],
       ['srijanya', 40, 34],
       ['usha_sri', 50, 45],
       ['sagari', 35, 50]], dtype=object)

In [60]:
final.values[2]

array(['usha_sri', 50, 45], dtype=object)

In [61]:
final.values[2][0]

'usha_sri'

In [64]:
for i in final.values:
    print(i[0],i[1],i[2])

vyshnavi 30 45
srijanya 40 34
usha_sri 50 45
sagari 35 50

In [65]:
final.loc['111']=['zzz',34,56]

In [66]:
final.head()

         NAME  ENGLISH  MATHS
515  vyshnavi       30     45
507  srijanya       40     34
547  usha_sri       50     45
537    sagari       35     50
111       zzz       34     56

In [67]:
final.values[2]=['naga usha sri',50,45]
final

         NAME  ENGLISH  MATHS
515  vyshnavi       30     45
507  srijanya       40     34
547  usha_sri       50     45
537    sagari       35     50
111       zzz       34     56

In [68]:
final=final.drop('111')
final

         NAME  ENGLISH  MATHS
515  vyshnavi       30     45
507  srijanya       40     34
547  usha_sri       50     45
537    sagari       35     50

In [69]:
final.columns.tolist() #      display the columns names in a list

['NAME', 'ENGLISH', 'MATHS']

In [70]:
final.columns

Index(['NAME', 'ENGLISH', 'MATHS'], dtype='object')

In [71]:
final.describe()#    it analyze the entire data

         ENGLISH      MATHS
count   4.000000   4.000000
mean   38.750000  43.500000
std     8.539126   6.757712
min    30.000000  34.000000
25%    33.750000  42.250000
50%    37.500000  45.000000
75%    42.500000  46.250000
max    50.000000  50.000000

In [72]:
final.max() # it displays the maximum of each columns

NAME       vyshnavi
ENGLISH          50
MATHS            50
dtype: object

In [111]:
final

         NAME  ENGLISH  MATHS
515  vyshnavi       30     45
507  srijanya       40     34
547  usha_sri       50     45
537    sagari       35     50

In [110]:
final['MATHS']

515    45
507    34
547    45
537    50
Name: MATHS, dtype: int64

In [73]:
# for a particular column
final['MATHS'].max()

50

In [74]:
final['MATHS'].min()

34

In [75]:
# to find mean of a particular column
final['MATHS'].mean()

43.5

In [82]:
income=pd.read_csv('income.csv')

In [83]:
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [84]:
income.values

array([['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
        42590, 43464, 41381],
       ['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [108]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [90]:
income.values[1,1] , income.values[1][1]

('Alaska', 'Alaska')

In [101]:
print(income.columns[1],':',income.columns[-1])
for i in income.values:
    print(i[1],':',i[-1])

State : 2013
Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [107]:
s=0
for i in range(2,11):
    s+=income.values[2,i]
s

424933